Функция СведенияОВнешнейОбработке() Экспорт 
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Наименование = "Акт общей формы";
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.Информация = "Внешняя печатная форма АОФ для документа ""уатАктПриемки"". Задача № 2542 Профрешение";
	ПараметрыРегистрации.БезопасныйРежим = Ложь; 
	ПараметрыРегистрации.Назначение = ПолучитьНазначениеОбработки();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Акт общей формы", "АОФ", ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода(), Ложь, "ПечатьMXL"); 
	
	Возврат ПараметрыРегистрации;
	
КонецФункции  

функция ПолучитьНазначениеОбработки() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Документ.уатАктПриемки_уэ");
	Возврат Массив;
	
КонецФункции    

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры 

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ТабличныйДокументПечатьАОФ = ПечатьАОФ(МассивОбъектов); 
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АОФ", Нстр("ru = 'Печать АОФ'"), ТабличныйДокументПечатьАОФ);
	
КонецПроцедуры 

Функция ПечатьАОФ(МассивОбъектов)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;  
	ТабДокумент.АвтоМасштаб = Истина;
	Макет = ПолучитьМакет("АОФ");
	
	Для Каждого мОбъект из МассивОбъектов Цикл 
		СсылкаНаДокумент = мОбъект.Ссылка;
		ОбластьМакетаДокумент = Макет.ПолучитьОбласть("ОбластьДокумент");
		ЗапросСходство = Новый Запрос;
		ЗапросСходство.УстановитьПараметр("ТекущийДокумент", СсылкаНаДокумент);
		ЗапросСходство.Текст =
		"ВЫБРАТЬ
		|	уатАктПриемки_уэГрузы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.уатАктПриемки_уэ.Грузы КАК уатАктПриемки_уэГрузы
		|ГДЕ
		|	уатАктПриемки_уэГрузы.Ссылка = &ТекущийДокумент
		|	И уатАктПриемки_уэГрузы.ВесБруттоПлан <> уатАктПриемки_уэГрузы.ВесБрутто"; 
		Результат = ЗапросСходство.Выполнить();
		Если Результат.Пустой() Тогда
			Сообщить("Документ № " + СсылкаНаДокумент.Номер + " от " + СсылкаНаДокумент.Дата + " не будет распечатан! Фактический вес совпадает с плановым. ");  
			Продолжить;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаДокумент);
		Запрос.Текст =		
		"ВЫБРАТЬ
		|	уатАктПриемки_уэ.Номер КАК Номер,
		|	уатАктПриемки_уэ.Дата КАК Дата,
		|	уатАктПриемки_уэ.Организация.Наименование КАК ОрганизацияНаименование,
		|	уатАктПриемки_уэ.ПР_Контрагент.Наименование КАК КонтрагентНаименование,
		|	уатАктПриемки_уэ.Склад.Представление КАК Склад,
		|	ВложенныйЗапрос.ВесБрутто КАК ВесБрутто,
		|	ВложенныйЗапрос.ВесБруттоПлан КАК ВесБруттоПлан,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	ВложенныйЗапрос.КоличествоПлан КАК КоличествоПлан,
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.уатАктПриемки_уэ КАК уатАктПриемки_уэ,
		|	(ВЫБРАТЬ
		|		СУММА(уатАктПриемки_уэГрузы.ВесБрутто) КАК ВесБрутто,
		|		СУММА(уатАктПриемки_уэГрузы.ВесБруттоПлан) КАК ВесБруттоПлан,
		|		СУММА(уатАктПриемки_уэГрузы.Количество) КАК Количество,
		|		СУММА(уатАктПриемки_уэГрузы.КоличествоПлан) КАК КоличествоПлан,
		|		уатАктПриемки_уэГрузы.ГрузовоеМесто КАК Номенклатура
		|	ИЗ
		|		Документ.уатАктПриемки_уэ.Грузы КАК уатАктПриемки_уэГрузы
		|	ГДЕ
		|		уатАктПриемки_уэГрузы.Ссылка =  &ТекущийДокумент
		|	
		|	СГРУППИРОВАТЬ ПО
		|		уатАктПриемки_уэГрузы.ГрузовоеМесто
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(уатАктПриемки_уэГрузы.ВесБрутто) <> СУММА(уатАктПриемки_уэГрузы.ВесБруттоПлан)) КАК ВложенныйЗапрос
		|ГДЕ
		|	уатАктПриемки_уэ.Ссылка = &ТекущийДокумент";		
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			ОбластьМакетаДокумент.Параметры.НомерДокумента = СсылкаНаДокумент.Номер;
			ОбластьМакетаДокумент.Параметры.ДатаДокумента = СсылкаНаДокумент.Дата;
			ОбластьМакетаДокумент.Параметры.КонтрагентНаименование = Выборка.КонтрагентНаименование;
			ОбластьМакетаДокумент.Параметры.ОрганизацияНаименование = Выборка.ОрганизацияНаименование;
			ОбластьМакетаДокумент.Параметры.Склад = Выборка.Склад; 
			ОбластьМакетаДокумент.Параметры.ВесБруттоПлан = Выборка.ВесБруттоПлан;
			ОбластьМакетаДокумент.Параметры.ВесБрутто = Выборка.ВесБрутто;
			ОбластьМакетаДокумент.Параметры.Количество = Выборка.Количество;
			ОбластьМакетаДокумент.Параметры.КоличествоПлан = Выборка.КоличествоПлан; 
			ОбластьМакетаДокумент.Параметры.Номенклатура = Выборка.Номенклатура;
			
			ТабДокумент.Вывести(ОбластьМакетаДокумент);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции